app/views/questions/index.html.erb

    <div class="panel-body" style="height:30px" >
      <% unless question.tags.blank? %>
---
SELECT "tags".* FROM "tags" INNER JOIN "questions_tags" ON "tags"."id" = "questions_tags"."tag_id" WHERE "questions_tags"."question_id" = 1