src/app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers"
---
	def index
		@answers = Answer.all()

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "25"]]
---
	def show
		@answer= Answer.find(params[:id])

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@answer = Answer.find( params[:id] )

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
---
	def new
		@answer = Answer.new()
		@question = Question.find(params[:question_id])

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "answers" SET "content" = 'Vous êtes toujours là ? tyhtyht', "updated_at" = '2014-01-09 21:15:51.372446' WHERE "answers"."id" = 1
---
	def update
		oldanswer = Answer.find(params[:id])
		if oldanswer.update_attributes(params[:answer])

INSERT INTO "answers" ("content", "created_at", "question_id", "score", "updated_at", "validated") VALUES (?, ?, ?, ?, ?, ?)  [["content", "tyjtyjtyj"], ["created_at", Thu, 09 Jan 2014 21:35:31 UTC +00:00], ["question_id", nil], ["score", nil], ["updated_at", Thu, 09 Jan 2014 21:35:31 UTC +00:00], ["validated", nil]]
---
	def create
		puts("create params hash : " )
		puts(params[:answer])
		answer = Answer.new(params[:answer])
		if answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "26"]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 26]]
---
	def destroy
		answer = Answer.find( params[:id])
		if answer.destroy