src/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%Post%')
---
	def index
		@posts = Post.all()

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "content" = 'This is the story of a man named Stanley. Stanley worked for a company in a big building where he was employee number 427. Employee Number 427''s job was simple: he sat at his desk in room 427, and he pushed buttons on a keyboard. Orders came to him through a monitor on his desk, telling him what buttons to push, how long to push them, and in what order. This is what Employee 427 did every day of every month and every year, and although others might have considered it soul-rending, Stanley relished every moment that the orders came in, as though he had been made exactly for this job. And Stanley was happy.', "title" = 'The Stanley Parable', "editionNo" = 1, "updated_at" = '2014-01-08 09:51:57.051546' WHERE "posts"."id" = 10
---
	def update
		@newpost = params[:post]
		@oldpost = Post.find( params[:id] )
		@oldpost.content = @newpost[:content]
		@oldpost.title = @newpost[:title]
		@oldpost.editionNo = @oldpost.editionNo + 1
		if @oldpost.save()

INSERT INTO "posts" ("content", "created_at", "editionNo", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Je suis un post"], ["created_at", Mon, 06 Jan 2014 23:15:12 UTC +00:00], ["editionNo", nil], ["title", "salut"], ["updated_at", Mon, 06 Jan 2014 23:15:12 UTC +00:00]]
---
	def create
		@post = Post.new(params[:post])
		@post.editionNo = 0
		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]
---
	def destroy
		@post = Post.find( params[:id])
		if @post.destroy