src/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE (title LIKE 'Qu%')
---
	def index
		@questions = Question.all()

INSERT INTO "questions" ("content", "created_at", "score", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Bonjour ?"], ["created_at", Wed, 08 Jan 2014 13:49:58 UTC +00:00], ["score", nil], ["title", "Bonjour, je suis une question ?"], ["updated_at", Wed, 08 Jan 2014 13:49:58 UTC +00:00]]
---
	def create
		question = Question.new(params[:question])
		if question.save