app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@answer = Answer.find( params[:id] )

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
---
	def new
		@answer = Answer.new()
		@question = Question.find(params[:question_id])

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "answers" SET "content" = 'Bwaaaaaahhhh !!!!!', "updated_at" = '2014-02-04 22:12:10.480064' WHERE "answers"."id" = 1
---
	def update
		oldanswer = Answer.find(params[:id])
		if oldanswer.update_attributes(params[:answer])

INSERT INTO "answers" ("content", "created_at", "question_id", "score", "updated_at", "user_id", "validated") VALUES (?, ?, ?, ?, ?, ?, ?)  [["content", ""], ["created_at", Tue, 04 Feb 2014 22:11:51 UTC +00:00], ["question_id", 1], ["score", nil], ["updated_at", Tue, 04 Feb 2014 22:11:51 UTC +00:00], ["user_id", 1], ["validated", nil]]
---
	def create
		puts("create params hash : " )
		puts(params[:answer])
		answer = Answer.new(params[:answer])
		answer.user = current_user
		if answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "2"]]
---
        def vote_for
           logger.info "***vote for***!!!"
           logger.info params[:id]
           @answ_vote_for = Answer.find(params[:id])

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "2"]]
---
         def vote_against
           logger.info "***vote against*!!!"
           logger.info params[:id]
           @answ_vote_against = Answer.find(params[:id])