app/controllers/posts_controller.rb

	def index
		@posts = Post.search(params[:search])
---
SELECT "posts".* FROM "posts"

	def create
		@post = current_user.posts.build(params[:post])

		@post.editionNo = 0
		#@post.user = current_user
		if @post.save
---
INSERT INTO "posts" ("content", "created_at", "editionNo", "title", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?)  [["content", "jkjkfjjkejkfjk"], ["created_at", Fri, 31 Jan 2014 10:56:56 UTC +00:00], ["editionNo", 0], ["title", "fekzfkj"], ["updated_at", Fri, 31 Jan 2014 10:56:56 UTC +00:00], ["user", nil]]

	def destroy
		@post = Post.find( params[:id])
		if @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]