app/controllers/questions_controller.rb

  def index
    # criteria = (params[:search] !=  nil) ? (lambda{|q| q.score}) : (lambda{|q| q.updated_at})
    # @questions = Question.search(params[:search]).sort_by{|q| criteria.call(q)}.reverse.paginate(:page => params[:page], :per_page => 8)

    if params[:search]
      # Si on fait une recherche dans les questions, on les trie par score
      @questions = Question.sort_by_score.search(params[:search]).paginate(:page => params[:page], :per_page => 8)
---
SELECT "questions".* FROM "questions" WHERE (LOWER(title) LIKE LOWER('%php%'))

  def create
    question = current_user.questions.build(params[:question])
    question.views = 0
    question.score = 0
    if question.save
---
INSERT INTO "questions" ("content", "created_at", "score", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "igfiegegfizgiu"], ["created_at", Tue, 04 Feb 2014 21:20:10 UTC +00:00], ["score", nil], ["title", "diugeifgi"], ["updated_at", Tue, 04 Feb 2014 21:20:10 UTC +00:00], ["user_id", nil]]

  def vote_for
    @quest_vote_for = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "3"]]

  def vote_against
    @quest_vote_against = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "3"]]