app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) LIKE LOWER('%C+%'))
---
def index

@tagsearch = Tag.search(params[:search]) #pour la recherche

INSERT INTO "tags" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 07 Feb 2014 13:21:47 UTC +00:00], ["description", "le java c'est super"], ["name", "java"], ["updated_at", Fri, 07 Feb 2014 13:21:47 UTC +00:00]]
---
  def create
    puts(params[:tag])
    @tag = Tag.new(params[:tag])
    if @tag.save

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
  def destroy
    tag = Tag.find( params[:id])
    if tag.destroy