app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
def index
		@users = User.search(params[:search])

		if params[:term]
			logger.info '**parametre term reçu**'
                        logger.info params[:term]
                         a=params[:term]
	@usera = User.find(:all,:conditions => ['LOWER(name) LIKE ? or LOWER(lastname) LIKE ?', "%"+a.downcase+"%","%"+a.downcase+"%"])

INSERT INTO "users" ("created_at", "email", "encrypted_password", "lastname", "login", "name", "points", "right", "salt", "study", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save